# Pandas

### Quick Notes:

1. Pandas is a high-level data manipulation tool developed by Wes McKinney. 
2. It is built on the *Numpy* package and its key data structure is called the DataFrame. 
3. DataFrames allow you to store and manipulate tabular data in rows of observations and columns of variables.

In [1]:
import numpy as np
import pandas as pd
import sklearn

In [2]:
from sklearn.datasets import load_boston

dataset = load_boston()
df = pd.DataFrame(dataset.data, columns=dataset.feature_names)
df['target'] = dataset.target

### 1. how to find the head or tail of the data set?

In [3]:
df.head(5)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,target
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [4]:
df.tail(5)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,target
501,0.06263,0.0,11.93,0.0,0.573,6.593,69.1,2.4786,1.0,273.0,21.0,391.99,9.67,22.4
502,0.04527,0.0,11.93,0.0,0.573,6.120,76.7,2.2875,1.0,273.0,21.0,396.90,9.08,20.6
503,0.06076,0.0,11.93,0.0,0.573,6.976,91.0,2.1675,1.0,273.0,21.0,396.90,5.64,23.9
504,0.10959,0.0,11.93,0.0,0.573,6.794,89.3,2.3889,1.0,273.0,21.0,393.45,6.48,22.0
505,0.04741,0.0,11.93,0.0,0.573,6.030,80.8,2.5050,1.0,273.0,21.0,396.90,7.88,11.9

### 2. How to get information about your data set?

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 506 entries, 0 to 505
Data columns (total 14 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   CRIM     506 non-null    float64
 1   ZN       506 non-null    float64
 2   INDUS    506 non-null    float64
 3   CHAS     506 non-null    float64
 4   NOX      506 non-null    float64
 5   RM       506 non-null    float64
 6   AGE      506 non-null    float64
 7   DIS      506 non-null    float64
 8   RAD      506 non-null    float64
 9   TAX      506 non-null    float64
 10  PTRATIO  506 non-null    float64
 11  B        506 non-null    float64
 12  LSTAT    506 non-null    float64
 13  target   506 non-null    float64
dtypes: float64(14)
memory usage: 55.5 KB

### 3. How to get the dimensions of your data set?

In [6]:
df.shape

(506, 14)

### 4. How to fetch the total row count of a data set and store it in a vairable?

In [7]:
#There could be many ways to achieve it, few options are below:

In [8]:
total_row_count = len(df['target'].index)

In [9]:
total_row_count

506

In [10]:
total_row_count_v2 = len(df.axes[0])

In [11]:
total_row_count_v2

506

### 5. how to fetch the total number of columns of a data set and store it in a vairable?

In [12]:
total_column_count = len(df.axes[1])

In [13]:
total_column_count

14

### 6. How to see statistical details of your dataset?

In [14]:
df.describe()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,target
count,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000
mean,3.613524,11.363636,11.136779,0.069170,0.554695,6.284634,68.574901,3.795043,9.549407,408.237154,18.455534,356.674032,12.653063,22.532806
std,8.601545,23.322453,6.860353,0.253994,0.115878,0.702617,28.148861,2.105710,8.707259,168.537116,2.164946,91.294864,7.141062,9.197104
min,0.006320,0.000000,0.460000,0.000000,0.385000,3.561000,2.900000,1.129600,1.000000,187.000000,12.600000,0.320000,1.730000,5.000000
25%,0.082045,0.000000,5.190000,0.000000,0.449000,5.885500,45.025000,2.100175,4.000000,279.000000,17.400000,375.377500,6.950000,17.025000
50%,0.256510,0.000000,9.690000,0.000000,0.538000,6.208500,77.500000,3.207450,5.000000,330.000000,19.050000,391.440000,11.360000,21.200000
75%,3.677083,12.500000,18.100000,0.000000,0.624000,6.623500,94.075000,5.188425,24.000000,666.000000,20.200000,396.225000,16.955000,25.000000
max,88.976200,100.000000,27.740000,1.000000,0.871000,8.780000,100.000000,12.126500,24.000000,711.000000,22.000000,396.900000,37.970000,50.000000

### 7. How to find missing values from a data frame?

In [15]:
# let's create a dummy data frame using below code..

d = {'Employee' : ['X', 'Y', 'Z'], 'Salary' : [1000, 2000, np.nan]}
emp = pd.DataFrame(d)
emp

  Employee  Salary
0        X  1000.0
1        Y  2000.0
2        Z     NaN

In [16]:
# find the row where salary is missing..

emp[pd.isnull(emp["Salary"])]

  Employee  Salary
2        Z     NaN

### 8. How to replace misisng Salary in above data set with the average salary?

In [17]:
# fillna() method is being used, note the inplace = True parameter.

emp['Salary'].fillna(value=emp['Salary'].mean(), inplace = True)

In [18]:
emp

  Employee  Salary
0        X  1000.0
1        Y  2000.0
2        Z  1500.0

### 9. How to get the distinct values of a particular column?

In [19]:
import pandas as pd
d = {'State': ['UP', 'UP', 'UP', 'UK', 'UK'], 'City': ['Lucknow', 'Kanpur', 'Agra', 'Dehradun', 'Haldwani'], 'Sale': [1000, 2000, 3000, 4000, 5000]}
df = pd.DataFrame(d)
df

  State      City  Sale
0    UP   Lucknow  1000
1    UP    Kanpur  2000
2    UP      Agra  3000
3    UK  Dehradun  4000
4    UK  Haldwani  5000

In [20]:
# get the distinct states..

df['State'].unique()

array(['UP', 'UK'], dtype=object)

### 10. Sometimes when our data is skewed we need to apply some transformation to bring data points in closer range. How can you apply log transformation in 2 numerical columns of a data set?

In [21]:
d = {"emp" : ['x', 'y', 'z'], "salary": [1000, 2000, 3000], "age" : [40, 50, 60]}

In [22]:
df = pd.DataFrame(d)
df

  emp  salary  age
0   x    1000   40
1   y    2000   50
2   z    3000   60

In [23]:
temp = df[['salary', 'age']].apply(lambda x : np.log(x+1))
temp

     salary       age
0  6.908755  3.713572
1  7.601402  3.931826
2  8.006701  4.110874

In [24]:
df

  emp  salary  age
0   x    1000   40
1   y    2000   50
2   z    3000   60

### 11. Sometimes you need to normalize your data so that each features are treated equally. It's important especially for those ML Algo which uses Gradient Descent as an optimization techinique e.g. Linear Regression, Logistic Regression or Neural Network and distance based algorithims e.g. KNN, K-Means and SVM. How can we apply MinMaxScaler in your data set?

In [25]:
from sklearn.preprocessing import MinMaxScaler

In [26]:
scaler = MinMaxScaler()

In [27]:
min_max = scaler.fit_transform(df[['salary', 'age']])

In [28]:
min_max

array([[0. , 0. ],
       [0.5, 0.5],
       [1. , 1. ]])